# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-pose keypoints/pose estimation model. For Usage examples see https://docs.ultralytics.com/tasks/pose

# Parameters
nc: 80 # number of classes
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolo11n-pose.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 344 layers, 2908507 parameters, 2908491 gradients, 7.7 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9948811 parameters, 9948795 gradients, 23.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 434 layers, 20973273 parameters, 20973257 gradients, 72.3 GFLOPs
  l: [1.00, 1.00, 512] # summary: 656 layers, 26230745 parameters, 26230729 gradients, 91.4 GFLOPs
  x: [1.00, 1.50, 512] # summary: 656 layers, 58889881 parameters, 58889865 gradients, 204.3 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, fasternet_t0, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]  # 5
  - [-1, 2, C2PSA, [1024]] # 6

# YOLO11n head
head:
  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 11
  - [ 3, 1, Conv, [ 512, 3, 2 ] ]
  - [[-1, 7], 1, ContextGuideFusionModule, [1]] # cat backbone P3
  - [ -1, 3, CSPStage, [ 512 ] ] # 14

  - [-1, 1, DySample, [2, 'lp']] #15
  - [ 2, 1, Conv, [ 256, 3, 2 ] ] # 16
  - [ [ 11, -1, 3 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, CSPStage, [ 512 ] ] # 18

  - [-1, 1, DySample, [2, 'lp']] #15
  - [ [ -1, 2 ], 1, ContextGuideFusionModule, [ 1 ] ]
  - [ -1, 3, CSPStage, [ 256 ] ] # 21

  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 14 ], 1, ContextGuideFusionModule, [ 1 ] ]
  - [ -1, 3, CSPStage, [ 512 ] ] # 24

  - [ 14, 1, Conv, [ 256, 3, 2 ] ] # 25
  - [ 20, 1, Conv, [ 256, 3, 2 ] ] # 26
  - [ [ 10, 21, -1 ], 1, Concat, [ 1 ] ]
  - [ -1, 3, CSPStage, [ 1024 ] ] # 28

  - [[17, 20, 24], 1, Pose_LSDECD, [nc, kpt_shape, 256]] # Detect(P3, P4, P5)